app/controllers/invoices_controller.rb

SELECT "invoices".* FROM "invoices"
---
  def index
    render json: Invoice.all

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    invoice = Invoice.find_by(id:params[:id])

INSERT INTO "invoices" ("user_id", "description", "client_name", "client_email", "status", "due_date", "logo", "item", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    invoice = @current_user.invoices.create!(invoice_params)

SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "invoices" WHERE "invoices"."id" = $1  [["id", 1]]
---
  def destroy
    invoice = Invoice.find_by(id: params[:id])
    invoice.destroy